#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dhoppeIT/terraform/runs/run-VEXjssw34HygpRJP

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.tfe-variable["slack_webhook_url"].tfe_variable.default: Refreshing state... [id=var-p2oGit56KT1ymkUJ]
module.tfe-organization.tfe_organization.default: Refreshing state... [id=dhoppeIT]
module.tfe-variable["github_token"].tfe_variable.default: Refreshing state... [id=var-mSuGiBrhDDpbnnKA]
module.tfe-notification.tfe_notification_configuration.default: Refreshing state... [id=nc-CXLzJMxdrcJTEqeH]
module.tfe-workspace.tfe_workspace.default: Refreshing state... [id=ws-UWLg4ecSLJxRnsHW]
module.tfe-organization.tfe_organization_token.default: Refreshing state... [id=dhoppeIT]
module.tfe-oauth_client.tfe_oauth_client.default: Refreshing state... [id=oc-oDAWGYCRuMwq773g]
module.tfe-registry["tfe-notification"].tfe_registry_module.default: Refreshing state... [id=mod-mwEP1ezsujnXsHxv]
module.tfe-registry["tfe-organization"].tfe_registry_module.default: Refreshing state... [id=mod-VDBddriYed1xJ4ug]
module.tfe-registry["tfe-workspace"].tfe_registry_module.default: Refreshing state... [id=mod-7nkJUsgXFHRTvd9v]
module.tfe-registry["tfe-oauth_client"].tfe_registry_module.default: Refreshing state... [id=mod-dq1GP3XfAteQzwXj]
module.tfe-registry["tfe-registry"].tfe_registry_module.default: Refreshing state... [id=mod-Ndsr5jtF5ab6LRdz]
module.tfe-registry["tfe-variable"].tfe_registry_module.default: Refreshing state... [id=mod-nk8CXddmU4CT4gPZ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.tfe-notification.tfe_notification_configuration.default will be destroyed
  - resource "tfe_notification_configuration" "default" {
      - destination_type = "slack" -> null
      - email_addresses  = [] -> null
      - email_user_ids   = [] -> null
      - enabled          = true -> null
      - id               = "nc-CXLzJMxdrcJTEqeH" -> null
      - name             = "slack" -> null
      - triggers         = [
          - "run:errored",
          - "run:needs_attention",
        ] -> null
      - url              = (sensitive) -> null
      - workspace_id     = "ws-UWLg4ecSLJxRnsHW" -> null
    }

  # module.tfe-notification_aws.tfe_notification_configuration.default will be created
  + resource "tfe_notification_configuration" "default" {
      + destination_type = "slack"
      + email_addresses  = (known after apply)
      + email_user_ids   = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + name             = "slack"
      + triggers         = [
          + "run:errored",
          + "run:needs_attention",
        ]
      + url              = (sensitive)
      + workspace_id     = (known after apply)
    }

  # module.tfe-notification_terraform.tfe_notification_configuration.default will be created
  + resource "tfe_notification_configuration" "default" {
      + destination_type = "slack"
      + email_addresses  = (known after apply)
      + email_user_ids   = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + name             = "slack"
      + triggers         = [
          + "run:errored",
          + "run:needs_attention",
        ]
      + url              = (sensitive)
      + workspace_id     = (known after apply)
    }

  # module.tfe-variable["github_token"].tfe_variable.default will be destroyed
  - resource "tfe_variable" "default" {
      - category     = "terraform" -> null
      - description  = "The token used to authenticate with GitHub" -> null
      - hcl          = false -> null
      - id           = "var-mSuGiBrhDDpbnnKA" -> null
      - key          = "github_token" -> null
      - sensitive    = true -> null
      - value        = (sensitive value)
      - workspace_id = "ws-UWLg4ecSLJxRnsHW" -> null
    }

  # module.tfe-variable["slack_webhook_url"].tfe_variable.default will be destroyed
  - resource "tfe_variable" "default" {
      - category     = "terraform" -> null
      - description  = "The destination URL used to send Slack notifications" -> null
      - hcl          = false -> null
      - id           = "var-p2oGit56KT1ymkUJ" -> null
      - key          = "slack_webhook_url" -> null
      - sensitive    = true -> null
      - value        = (sensitive value)
      - workspace_id = "ws-UWLg4ecSLJxRnsHW" -> null
    }

  # module.tfe-variable_aws["github_token"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "terraform"
      + description  = "The token used to authenticate with GitHub"
      + hcl          = false
      + id           = (known after apply)
      + key          = "github_token"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe-variable_aws["slack_webhook_url"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "terraform"
      + description  = "The destination URL used to send Slack notifications"
      + hcl          = false
      + id           = (known after apply)
      + key          = "slack_webhook_url"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe-variable_terraform["github_token"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "terraform"
      + description  = "The token used to authenticate with GitHub"
      + hcl          = false
      + id           = (known after apply)
      + key          = "github_token"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe-variable_terraform["slack_webhook_url"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "terraform"
      + description  = "The destination URL used to send Slack notifications"
      + hcl          = false
      + id           = (known after apply)
      + key          = "slack_webhook_url"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe-workspace.tfe_workspace.default will be destroyed
  - resource "tfe_workspace" "default" {
      - allow_destroy_plan            = true -> null
      - auto_apply                    = false -> null
      - description                   = "Provision of Terraform Cloud/Enterprise resources" -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - global_remote_state           = false -> null
      - id                            = "ws-UWLg4ecSLJxRnsHW" -> null
      - name                          = "terraform" -> null
      - operations                    = true -> null
      - organization                  = "dhoppeIT" -> null
      - queue_all_runs                = false -> null
      - remote_state_consumer_ids     = [] -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "terraform",
        ] -> null
      - terraform_version             = "1.0.11" -> null
      - trigger_prefixes              = [] -> null

      - vcs_repo {
          - branch             = "main" -> null
          - identifier         = "dhoppeIT/terraform-tfe-config" -> null
          - ingress_submodules = false -> null
          - oauth_token_id     = "ot-dbdgPVfxEq5tkEWy" -> null
        }
    }

  # module.tfe-workspace_aws.tfe_workspace.default will be created
  + resource "tfe_workspace" "default" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "Provision of Amazon Web Services resources"
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = false
      + id                            = (known after apply)
      + name                          = "aws"
      + operations                    = (known after apply)
      + organization                  = "dhoppeIT"
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "aws",
        ]
      + terraform_version             = "1.0.11"
      + trigger_prefixes              = []

      + vcs_repo {
          + branch             = "main"
          + identifier         = "dhoppeIT/terraform-aws-config"
          + ingress_submodules = false
          + oauth_token_id     = "ot-dbdgPVfxEq5tkEWy"
        }
    }

  # module.tfe-workspace_terraform.tfe_workspace.default will be created
  + resource "tfe_workspace" "default" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "Provision of Terraform Cloud/Enterprise resources"
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = false
      + id                            = (known after apply)
      + name                          = "terraform"
      + operations                    = (known after apply)
      + organization                  = "dhoppeIT"
      + queue_all_runs                = false
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "terraform",
        ]
      + terraform_version             = "1.0.11"
      + trigger_prefixes              = []

      + vcs_repo {
          + branch             = "main"
          + identifier         = "dhoppeIT/terraform-tfe-config"
          + ingress_submodules = false
          + oauth_token_id     = "ot-dbdgPVfxEq5tkEWy"
        }
    }

Plan: 8 to add, 0 to change, 4 to destroy.


```

</details>

*Pusher: @dhoppe, Action: `pull_request`*